relatorio/relatorio.tex
% Created 2022-05-10 ter 11:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}

\usepackage{amsthm}
\theoremstyle{definition}
\newtheorem{teo}{Teorema}[section]
\theoremstyle{definition}
\newtheorem{defi}{Definicao}[section]
\theoremstyle{remark}
\newtheorem{obs}{Observação}[section]
\theoremstyle{remark}
\newtheorem{lema}{Lema}[section]
\theoremstyle{remark}
\newtheorem{prop}{Propriedade}[section]
\theoremstyle{remark}
\newtheorem{coro}{Corolario}[section]
\theoremstyle{definition}
\newtheorem{prep}{Preposição}[section]
\author{Ieremies Romero, Lucas de Oliveira Silva}
\date{\today}
\title{MC833 - Relatório do Projeto 1}
\hypersetup{
 pdfauthor={Ieremies Romero, Lucas de Oliveira Silva},
 pdftitle={MC833 - Relatório do Projeto 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={Portuguese}}
\usepackage{biblatex}
\addbibresource{~/arq/bib.bib}
\begin{document}

\maketitle

\section*{Introdução}
\label{sec:org54b0d6c}
Este projeto tem como o objetivo desenvolver uma comunicação cliente-servidor utilizando uma conexão TCP. Para isso, utilizamos um servidor concorrente capaz de fornecer, guardar e atualizar informações sobre filmes. O cliente, é capaz de recuperar ou alterar essas informações via protocolo HTTP.

\section*{Descrição}
\label{sec:org3d3db05}
Para esse projeto, desenhamos nosso sistema de forma modular e escalonável. Assim, o servidor possui operações simples e diretas, enquanto que o refinamento de tais fica a cargo do cliente.

Nosso servidor serve para fornecer uma lista de filme e suas informações. Ele pode ser utilizado como um armazém de informações que diversos clientes podem acessa-lo de forma assíncrona e fazer mudanças.

Por exemplo, digamos que um usuário está procurando por um filme de ação. Caso o administrador queira adicionar mais um filme de ação enquanto isso ocorre, o servidor será capaz de fazer as modificações e já servir, quando requisitado, o novo conjunto de filmes.

Vale ressaltar que não há autenticação dos usuários, partimos do pressuposto que todos eles são administradores.
\section*{Casos de uso}
\label{sec:orga72436f}
Neste projeto, podemos utilizar \texttt{cmake} para construir o \texttt{Makefile}.

\begin{verbatim}
mkdir build
cd build
cmake ../CMakeLists.txt
make
\end{verbatim}

Após compilado, dois executáveis estarão disponíveis: \texttt{server} e \texttt{client}.

O servidor, uma vez executado, sentará em silêncio aguardando conexões. Em contrapartida, o cliente irá propor operações e solicitar as informações.

\section*{Armazenamento e estruturas de dados}
\label{sec:org394890d}
As informações armazenadas estão contidas no arquivo \texttt{data/movie.h} que contém a \texttt{struct Movie} composta dos seguintes campos:
\begin{description}
\item[{\texttt{id}}] Um identificador numérico único.
\item[{\texttt{title}}] Uma string contendo o título do filme.
\item[{\texttt{num\_genres}}] A quantidade de gêneros cadastrados ao filme.
\item[{\texttt{genre\_list}}] Os gêneros cadastrados ao filme.
\item[{\texttt{director\_name}}] Uma string contendo o nome do diretor.
\item[{\texttt{year}}] O ano de publicação do filme.
\end{description}

Para armazenar uma lista de filmes, possuímos a \texttt{struct Catalog} definida no arquivo \texttt{data/Catalog.h} que se resume a um vetor de \texttt{struct Movie} e o indicador de quantos filmes a lista contém (\texttt{size}).

\section*{Implementação}
\label{sec:orgc5d0d98}
\subsection*{Servidor}
\label{sec:org65ff9e9}
No lado do servidor, começamos populando a \texttt{struct addrinf} com algumas informações e passando-a para a função \texttt{getaddrinfo()} que nos retorna uma lista ligada de IP's disponíveis. Como indicado pelo tutorial fornecido, iteramos pelas possibilidades recuperando o socket descriptor, conferimos se está totalmente livre para ser utilizado com \texttt{setsockopt} e nos conectamos ao primeiro disponível com \texttt{bind()}.

Caso tudo isso tenha sido feito com êxito, garantimos que processos zombies serão tratados e avisar que o socket será limpo, antes de, finalmente, começar a escutar por conexões. No laço \texttt{while}, aceitamos novas conexões com \texttt{accept()} e executamos \texttt{handle\_client()}, função responsável por agir em vista das requisições do cliente.

\subsubsection*{Operações do servidor}
\label{sec:org920b4cb}
O servidor é capaz de servir as seguintes operações:
\begin{description}
\item[{\textbf{GET}}] retorna todo o catálogo.
\item[{\textbf{POST}}] coloca um novo filme no catálogo, determinando um ID único para ele. Caso não haja espaço, nada é feito.
\item[{\textbf{PUT}}] baseado no ID de uma struct movie, modificamos as informações do tal filme baseado nas informações preenchidas na struct.
\item[{\textbf{DEL}}] baseado no ID de uma struct movie, removemos o filme com a mesma ID do catálogo.
\end{description}


\subsection*{Cliente}
\label{sec:org3a8640a}
No lado do cliente fazemos algo muito parecido. Populamos a \texttt{struct addrinf} com as informações e, junto com a função \texttt{getaddrinfo()}, iteramos pelos possíveis sockets até conseguirmos nos conectar a algum com o \texttt{bind()}. Caso tudo isso tenha sido bem sucedido, fazemos a limpeza final antes de passar o controle para a função \texttt{handle\_user()}.

O cliente comunica-se com o servidor mediante as operações acima listadas, mas para o nosso usuário mais opções são apresentadas. Para as diferentes listagem de filmes e suas informações, fazemos esse filtro do lado do cliente, permitindo um controle maior de quais informações são apresentadas baseado no cliente. Seria possível, então, termos diversos clientes, com interfaces diferentes, conectando-se ao mesmo servidor.

\subsubsection*{Operações do cliente}
\label{sec:org5cebaef}
Do ponto de vista do cliente, ele pode realizar as seguintes operações:

\begin{itemize}
\item cadastrar um novo filme, fornecendo suas informações.
\item acrescentar um gênero a um filme.
\item deletar um file a partir de seu identificador.
\item listar filmes:
\begin{itemize}
\item com seus títulos e indicadores.
\item com todas as informações.
\item de um gênero específico.
\item todas as informações de um filme em específico.
\end{itemize}
\end{itemize}

\section*{Conclusão}
\label{sec:org04c374d}
Assim, temos um servidor capaz de realizar operações e um cliente capaz de comunicar-se com o servidor e solicitar informações ao usuário.
\end{document}
